Repository: SaintAngeLs/jpk_vat_7_from_xlsx_csv
Catalog: src/JpkVat7.Web/JpkVat7.LibClient.Web.Wasm/Resources/Pages.Home.*.resx
Languages: pl

# Title
source: JPK XML Converter
pl: Konwerter JPK XML

# Subtitle
source: Upload a <b>CSV</b> or <b>XLSX</b> file, convert it on the server via <b>gRPC-Web</b>, then download the resulting <b>XML</b>.
pl: Wgraj plik <b>CSV</b> lub <b>XLSX</b>, skonwertuj go na serwerze przez <b>gRPC-Web</b>, a następnie pobierz wynikowy <b>XML</b>.

# Info
source: Conversion happens on the server, so your browser stays responsive. Large files may take a moment.
pl: Konwersja odbywa się na serwerze, więc przeglądarka pozostaje responsywna. Duże pliki mogą zająć chwilę.

# Step1
source: 1) Select input
pl: 1) Wybierz format

source: Input format
pl: Format wejściowy

# AutoDetect
source: Auto-detect (CSV / XLSX)
pl: Automatycznie (CSV / XLSX)

# Step2
source: 2) Upload file
pl: 2) Wgraj plik

# DropTitle
source: Drag & drop your file here
pl: Przeciągnij i upuść plik tutaj

# DropOr
source: or click to browse
pl: lub kliknij, aby wybrać

source: Allowed
pl: Dozwolone

# RemoveFile
source: Remove selected file
pl: Usuń wybrany plik

# Step3
source: 3) Convert
pl: 3) Konwertuj

# Convert
source: Convert to XML
pl: Konwertuj do XML

source: Converting…
pl: Konwertowanie…

# Download
source: Download XML
pl: Pobierz XML

source: Reset
pl: Resetuj

# KeepOpen
source: Please keep this tab open while the server processes the file.
pl: Pozostaw tę kartę otwartą podczas przetwarzania na serwerze.

# Step4
source: 4) XML Preview
pl: 4) Podgląd XML

# Copy
source: Copy XML to clipboard
pl: Kopiuj XML do schowka

source: Clear preview
pl: Wyczyść podgląd

# PreviewHint
source: This is a read-only preview. Use “Download XML” to save the file.
pl: To jest podgląd tylko do odczytu. Użyj „Pobierz XML”, aby zapisać plik.

# NoXml
source: No XML yet. Upload a file and click “Convert to XML”.
pl: Brak XML. Wgraj plik i kliknij „Konwertuj do XML”.

# BusyTitle
source: Converting on server…
pl: Konwersja na serwerze…

# BusyHint
source: This can take longer for large files or complex spreadsheets.
pl: Dla dużych plików lub złożonych arkuszy może to potrwać dłużej.

# StatusFileSelected
source: File selected. Ready to convert.
pl: Plik wybrany. Gotowe do konwersji.

# StatusFileMismatch
source: File selected, but it doesn’t match the current filter. Change the filter or select another file.
pl: Plik wybrany, ale nie pasuje do filtra. Zmień filtr lub wybierz inny plik.

# StatusDrop
source: Drop detected. Please click the area to choose the file (browser security restriction).
pl: Wykryto upuszczenie. Kliknij obszar, aby wybrać plik (ograniczenie przeglądarki).

# StatusStarting
source: Starting conversion…
pl: Rozpoczynam konwersję…

# StatusDone
source: Done. XML generated successfully.
pl: Gotowe. XML został wygenerowany.

# StatusFailed
source: Failed.
pl: Niepowodzenie.

# StatusFailedTimeout
source: Failed (timeout).
pl: Niepowodzenie (timeout).

# StatusFailedException
source: Failed (exception).
pl: Niepowodzenie (wyjątek).

# ErrorTimeout
source: Timed out or cancelled (120s limit).
pl: Przekroczono limit czasu lub anulowano (120s).

# ErrorConversionFailed
source: Conversion failed.
pl: Konwersja nie powiodła się.

# TooltipCopy
source: Copy XML to clipboard
pl: Kopiuj XML do schowka

# TooltipClear
source: Clear preview
pl: Wyczyść podgląd
